###  Results for `terraform plan` on `dev` 

<details>
<summary>Show output</summary>

```diff
data.aws_ssm_parameter.subnet_private_1a: Reading...
data.aws_ssm_parameter.subnet_private_1b: Reading...
data.aws_ssm_parameter.subnet_public_1c: Reading...
data.aws_ssm_parameter.subnet_private_1c: Reading...
data.aws_ssm_parameter.subnet_public_1b: Reading...
aws_iam_role.main: Refreshing state... [id=cluster-instance-profile]
data.aws_ssm_parameter.vpc: Reading...
data.aws_ssm_parameter.subnet_public_1a: Reading...
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-east-1:354040364707:cluster/cluster]
data.aws_ssm_parameter.subnet_public_1c: Read complete after 0s [id=/arq-EKS/vpc/subnet_public_1c]
data.aws_ssm_parameter.subnet_public_1b: Read complete after 0s [id=/arq-EKS/vpc/subnet_public_1b]
data.aws_ssm_parameter.subnet_private_1c: Read complete after 0s [id=/arq-EKS/vpc/subnet_private_1c]
data.aws_ssm_parameter.subnet_public_1a: Read complete after 0s [id=/arq-EKS/vpc/subnet_public_1a]
data.aws_ssm_parameter.subnet_private_1b: Read complete after 0s [id=/arq-EKS/vpc/subnet_private_1b]
data.aws_ssm_parameter.vpc: Read complete after 0s [id=/arq-EKS/vpc/vpc_id]
data.aws_ssm_parameter.subnet_private_1a: Read complete after 0s [id=/arq-EKS/vpc/subnet_private_1a]
aws_security_group.lb: Refreshing state... [id=sg-046a404d2b1251798]
aws_security_group.main: Refreshing state... [id=sg-080340185bf03723b]
aws_iam_role_policy_attachment.ec2_ssm: Refreshing state... [id=cluster-instance-profile-20240921180625210900000002]
aws_iam_role_policy_attachment.ec2_role: Refreshing state... [id=cluster-instance-profile-20240921180625071600000001]
aws_iam_instance_profile.main: Refreshing state... [id=cluster-instance-profile]
aws_security_group_rule.ingress_443: Refreshing state... [id=sgrule-316377514]
aws_security_group_rule.ingress_80: Refreshing state... [id=sgrule-3961435154]
aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:354040364707:loadbalancer/app/cluster-ingress/645ad2896d4882f2]
aws_security_group_rule.subnet_ranges: Refreshing state... [id=sgrule-4184197639]
aws_launch_template.on_demand: Refreshing state... [id=lt-03f638bcf6dee32e6]
aws_launch_template.spots: Refreshing state... [id=lt-07bb766ed9eb69ada]
aws_autoscaling_group.on_demand: Refreshing state... [id=cluster-on-demand20240921180627032300000007]
aws_lb_listener.main: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:354040364707:listener/app/cluster-ingress/645ad2896d4882f2/497e6bde638c0f9d]
aws_autoscaling_group.spots: Refreshing state... [id=cluster-spots20240921180627138700000008]
aws_ecs_capacity_provider.on_demand: Refreshing state... [id=arn:aws:ecs:us-east-1:354040364707:capacity-provider/cluster-on-demand]
aws_ecs_capacity_provider.spots: Refreshing state... [id=arn:aws:ecs:us-east-1:354040364707:capacity-provider/cluster-spots]
aws_ecs_cluster_capacity_providers.main: Refreshing state... [id=cluster]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ssm_parameter.lb_arn will be created
  + resource "aws_ssm_parameter" "lb_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/linuxtips/ecs/lb/id"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.lb_listener will be created
  + resource "aws_ssm_parameter" "lb_listener" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/linuxtips/ecs/lb/listerner"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + lb_ssm_arn        = (known after apply)
  + lb_ssm_listener   = (known after apply)
  + load_balancer_dns = "cluster-ingress-1269315300.us-east-1.elb.amazonaws.com"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>